## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.roleassignment-spn_admin-rg-sadatareader.azurerm_role_assignment.RBAC-uami will be created
  + resource "azurerm_role_assignment" "RBAC-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c45e89ca-8212-45e9-8b55-f26b6040f9aa"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader and Data Access"
      + scope                            = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>